# Ultralytics YOLO ­Ъџђ, AGPL-3.0 license
# [W-RT-DETR-R18] жЁЇуй«ТќЄС╗Х
# ТаИт┐ЃуГќуЋЦ№╝џТаЄтЄє ResNet18 жфет╣▓ (тљЃжбёУ«Гу╗Ѓу║бтѕЕ) + т░ЈТ│бСИіжЄЄТаи (СйауџётѕЏТќ░) + т»єт║дтц┤

# тЪ║уАђтЈѓТЋ░
nc: 10  # VisDrone у▒╗тѕФТЋ░
scales: # ТеАтъІу╝ЕТћЙтЏатГљ
  r18: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  # === ResNet18 ТаЄтЄєжфет╣▓ (С┐ЮТїЂтјЪТаиС╗ЦтіаУйй COCO ТЮЃжЄЇ) ===
  - [-1, 1, ResNetLayer, [64, 3, 7, 1]]  # 0  P1/2
  - [-1, 1, ResNetLayer, [64, 2, 3, 1]]  # 1  P2/4
  - [-1, 1, ResNetLayer, [128, 2, 3, 2]] # 2  P3/8
  - [-1, 1, ResNetLayer, [256, 2, 3, 2]] # 3  P4/16
  - [-1, 1, ResNetLayer, [512, 2, 3, 2]] # 4  P5/32

head:
  # === Hybrid Encoder т╝ђтДІ ===
  # тцёуљє P5
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 5 (input_proj.2)
  - [-1, 1, AIFI, [1024, 8]] # 6
  - [-1, 1, Conv, [256, 1, 1]]   # 7 (Y5)

  # ­ЪћЦ [тѕЏТќ░уѓ╣] P5 -> P4 СИіжЄЄТаи (ТЏ┐ТЇбТаЄтЄє Upsample СИ║ т░ЈТ│бСИіжЄЄТаи)
  - [-1, 1, WaveletUpsample, [256]] # 8

  # тцёуљє P4
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 9 (input_proj.1)
  - [[-2, -1], 1, Concat, [1]] # 10
  - [-1, 3, RepC3, [256, 0.5]] # 11 (fpn_blocks.0)
  - [-1, 1, Conv, [256, 1, 1]] # 12 (Y4)

  # ­ЪћЦ [тѕЏТќ░уѓ╣] P4 -> P3 СИіжЄЄТаи (ТЏ┐ТЇбТаЄтЄє Upsample СИ║ т░ЈТ│бСИіжЄЄТаи)
  - [-1, 1, WaveletUpsample, [256]] # 13

  # тцёуљє P3
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 14 (input_proj.0)
  - [[-2, -1], 1, Concat, [1]] # 15
  - [-1, 3, RepC3, [256, 0.5]] # 16 (fpn_blocks.1 -> P3 output)

  # === СИІжЄЄТаиУи»тЙё (PANet) ===
  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 12], 1, Concat, [1]] # 18 (cat Y4)
  - [-1, 3, RepC3, [256, 0.5]] # 19 (pan_blocks.0 -> P4 output)

  - [-1, 1, Conv, [256, 3, 2]] # 20
  - [[-1, 7], 1, Concat, [1]] # 21 (cat Y5)
  - [-1, 3, RepC3, [256, 0.5]] # 22 (pan_blocks.1 -> P5 output)

  # === ТБђТхІтц┤ ===
  # тЈфУдЂСйауџёС╗БуаЂжЄїжЏєТѕљС║єт»єт║дтц┤№╝їУ┐ЎжЄї RTDETRDecoder С╝џУЄфтіеТїѓУйй
  - [[16, 19, 22], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)